In [2]:
import pandas as pd
import numpy as np
import scipy.stats as stats

In [3]:
data=pd.read_csv('Advertising.csv')
data

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [5]:
#Dataset details
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [6]:
data_1 = data.drop(["Unnamed: 0"], axis = 1)
data_1

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [ ]:
#Checking the summary statistics

In [7]:
data_1.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [ ]:
 #discuss the max, min, avg, median, and percentiles.

In [12]:
#Minimum values of data
data_1.min()

TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

In [13]:
#Maxmum values of data
data_1.max()

TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

In [14]:
# Average values of data
data_1.mean()

TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

In [15]:
#Median of data
data_1.median()

TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

In [16]:
# Percentiles of data
data_1.quantile([.25,.5,.75])

           TV   Radio  Newspaper   Sales
0.25   74.375   9.975      12.75  10.375
0.50  149.750  22.900      25.75  12.900
0.75  218.825  36.525      45.10  17.400

#The manager wants to find out whether the same amount was spent  for the three advertisements (TV , Radio and Newspaper). Comment 
on your findings

In [ ]:
#One way Anova test is used to find the test.
#Hypothesis
#H0:Amount spent for three advertisments are same
#H1:Amount spent for three advertisments are not same

In [17]:
fvalue,pvalue = stats.f_oneway(data_1['TV'],data_1['Radio'],data_1['Newspaper'])
print(fvalue,pvalue)

358.8514595342597 4.552931539744962e-103

In [18]:
if pvalue<0.05:
    print(' Reject the null hypothesis')
else:
    print(' Fail to reject the null hypothesis')

 Reject the null hypothesis

In [ ]:
#Comments on findings

As p value is less than .05 we reject the null hypothesis and we can conclude that the amount spend for three advertisments (TV , Radio and Newspaper)are different.